In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
df=pd.read_csv("Data.csv")
X=df.iloc[ : , :-1 ].values
Y=df.iloc[: , -1].values

In [11]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [9]:
print(X)

[['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 nan]
 ['France' 35.0 58000.0]
 ['Spain' nan 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]

In [10]:

print(Y)

['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

In [12]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [15]:
df['Age'].mean()

38.77777777777778

In [16]:
df['Age']=df['Age'].fillna(38.777)

In [17]:
df.isnull().sum()

Country      0
Age          0
Salary       1
Purchased    0
dtype: int64

In [18]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [19]:
df.head(20)

   Country     Age   Salary Purchased
0   France  44.000  72000.0        No
1    Spain  27.000  48000.0       Yes
2  Germany  30.000  54000.0        No
3    Spain  38.000  61000.0        No
4  Germany  40.000      NaN       Yes
5   France  35.000  58000.0       Yes
6    Spain  38.777  52000.0        No
7   France  48.000  79000.0       Yes
8  Germany  50.000  83000.0        No
9   France  37.000  67000.0       Yes

In [20]:
df['Salary'].mean()

63777.77777777778

In [21]:
df['Salary']=df['Salary'].fillna(63777.77777)

In [22]:
df.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [23]:
df.head(20)

   Country     Age       Salary Purchased
0   France  44.000  72000.00000        No
1    Spain  27.000  48000.00000       Yes
2  Germany  30.000  54000.00000        No
3    Spain  38.000  61000.00000        No
4  Germany  40.000  63777.77777       Yes
5   France  35.000  58000.00000       Yes
6    Spain  38.777  52000.00000        No
7   France  48.000  79000.00000       Yes
8  Germany  50.000  83000.00000        No
9   France  37.000  67000.00000       Yes